"""1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами."""
def hello():
    print("Добро пожаловать!")

def salary(output, rate, premium):
    return (int(output) * int(rate)) + int(premium)
